In [2]:
import pandas as pd

pd.read_excel(("/Users/palammysurareddy/Downloads/Rawdata.xlsx"))

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [6]:
import pandas as pd

emp=pd.read_excel(("/Users/palammysurareddy/Downloads/Rawdata.xlsx"))

In [8]:
emp.shape

(6, 6)

In [9]:
len(emp)

6

In [14]:
emp.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [15]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [16]:
emp

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [19]:
emp['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [20]:
emp['Domain']

0     Datascience#$
1           Testing
2    Dataanalyst^^#
3       Ana^^lytics
4        Statistics
5               NLP
Name: Domain, dtype: object

In [22]:
emp['Salary']

0     5^00#0
1    10%%000
2    1$5%000
3     2000^0
4     30000-
5    6000^$0
Name: Salary, dtype: object

In [23]:
emp['Age']

0    34 years
1      45' yr
2         NaN
3         NaN
4       67-yr
5        55yr
Name: Age, dtype: object

In [24]:
emp['Location']

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: Location, dtype: object

In [25]:
emp[['Name','Salary']]

     Name   Salary
0    Mike   5^00#0
1  Teddy^  10%%000
2   Uma#r  1$5%000
3    Jane   2000^0
4  Uttam*   30000-
5     Kim  6000^$0

In [26]:
emp[['Age','Location']]

        Age   Location
0  34 years     Mumbai
1    45' yr  Bangalore
2       NaN        NaN
3       NaN   Hyderbad
4     67-yr        NaN
5      55yr      Delhi

In [28]:
emp[['Name','Age','Domain','Salary','Location','Exp']]

     Name       Age          Domain   Salary   Location      Exp
0    Mike  34 years   Datascience#$   5^00#0     Mumbai       2+
1  Teddy^    45' yr         Testing  10%%000  Bangalore       <3
2   Uma#r       NaN  Dataanalyst^^#  1$5%000        NaN   4> yrs
3    Jane       NaN     Ana^^lytics   2000^0   Hyderbad      NaN
4  Uttam*     67-yr      Statistics   30000-        NaN  5+ year
5     Kim      55yr             NLP  6000^$0      Delhi      10+

data cleaning

In [29]:
emp['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [32]:
emp['Name']=emp['Name'].str.replace(r'\w','')

In [33]:
emp['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [34]:
emp['Domain']=emp['Domain'].str.replace(r'\w','')

In [35]:
emp['Domain']

0     Datascience#$
1           Testing
2    Dataanalyst^^#
3       Ana^^lytics
4        Statistics
5               NLP
Name: Domain, dtype: object

In [36]:
emp['Age']=emp['Age'].str.replace(r'\w','')

In [37]:
emp['Age']

0    34 years
1      45' yr
2         NaN
3         NaN
4       67-yr
5        55yr
Name: Age, dtype: object

In [3]:
emp

NameError: name 'emp' is not defined

In [2]:
emp['Location'] = emp['Location'].str.replace(r'\w','')

NameError: name 'emp' is not defined

In [40]:
emp['Location']

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: Location, dtype: object

In [73]:
emp['Salary'] = emp['Salary'].str.replace(r'\w','')

In [54]:
clean_data

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [55]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [64]:
import numpy as np

In [65]:
clean_data

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [71]:
clean_data.head(1)

   Name         Domain       Age Location  Salary Exp
0  Mike  Datascience#$  34 years   Mumbai  5^00#0  2+

In [60]:
clean_data['Age']

0    34 years
1      45' yr
2         NaN
3         NaN
4       67-yr
5        55yr
Name: Age, dtype: object

In [1]:
clean_data['Age'] = clean_data['Age'].fillna(np.mean(pd.to_numeric(clean_data['Age'])))

NameError: name 'clean_data' is not defined

In [2]:
clean_data['Age']

NameError: name 'clean_data' is not defined